import React from 'react';

export default function AboutPage() {
  return (
    <div className="container mx-auto py-16">
      <h1 className="text-3xl md:text-4xl font-bold mb-8 text-center">دەربارەی بنووسە</h1>
      <div className="max-w-3xl mx-auto text-right">
        <p className="text-lg mb-6">
          بنووسە پلاتفۆرمێکی کوردییە کە تایبەتە بە بەشداریکردنی زانیاری و بابەتە هزرییەکان. ئامانجمان درووستکردنی شوێنێکە بۆ نووسەران تا وتار لەسەر زانست، مێژوو، هونەر، و بابەتی دیکە بە زمانی کوردی بڵاو بکەنەوە.
        </p>

        <h2 className="text-2xl font-bold mt-10 mb-4">ئامانجی ئێمە</h2>
        <p className="mb-6">
        ئامانجی ئێمە پێشخستنی ئەدەب و گوتاری هزری کوردییە لە رێگەی دابینکردنی پلاتفۆرمێک کە نووسەران بتوانن زانیارییەکانیان بەشداری پێبکەن و خوێنەران بتوانن دەستیان بە ناوەڕۆکی بابەتەکان بگات بە کوالێتی بەرز.
        </p>

        <h2 className="text-2xl font-bold mt-10 mb-4">روانگەی ئێمە</h2>
        <p className="mb-6">
          ئێمە داهاتوویەک دەبینین کە زمانی کوردی و زاراوەکانی بەپێی پێویست وەک نووسراو لە کۆگایەکی دەوڵەمەند و فراوان لە زانیاری کۆکراونەتەوە، کە بەشداری دەکات لە پاراستن و گەشەپێدانی کەلتوور و توانستی هزری کوردی بکات بەشێوەیەکی بەرچاو.
        </p>

        <h2 className="text-2xl font-bold mt-10 mb-4">تیمی ئێمە</h2>
        <p className="mb-6">
        بنووسە لەلایەن تیمێکی دیاریکراو لە نووسەران، ئیدیتەران و پەرەپێدەران بەڕێوە دەبرێت بەشێوەیەکی خۆبەخشانە و قازانج نەویستانە کە ئارەزوومەندی کەلتوور و ئەدەبی کوردین. ئێمە پابەندین بە درووستکردنی پلاتفۆرمێک کە خزمەتی کۆمەڵگەی کوردی بکات، زمانی کوردی و زاراوەکانی وەک زمانی فێربوون زانیاری و بنرخێنێ.
        </p>
      </div>
    </div>
  );
} 